//this is my first JavaScript code
console.log ('Hello, I am a programmer');

/* Δήλωση μεταβλητών στην JS γίνεται ως εξής:
α τρόπος*/ let firstName = 'Dinos', lastName = 'Maz' /* ή β τρόπος*/; let fisrtNames = 'Dino'; let lastNames='Mazs';
/*Άλλοι κανόνες¨
α. Δεν χρησμοποιούμε λέξεις που χρησιμοποιεί το πρόγραμμα, όπως let, if, else
β. Τα ονόματα πρέπει να έχουν κάποιο νόημα, για αργότερα όταν θέλουμε να κάνουμε αλλαγές ή να καταλάβουμε τον κώδικα
γ. Τα ονόματα δεν έχουν κενά ή -
δ. Υπάρχει διαφοροποίηση του ίδιου ονόματος αν είναι γραμμένος με μικρα ή κεφαλαία ή συνδιασμό, π.χ firstname ειναι διαφορετικό από το FirstName
ε. Δεν πρέπει να ξεκινάνε από αριθμό, π.χ. 1firstName. Θα εμφανίσει Error */
const mynumber='6995459816';
alert (mynumber);